'''
6. Дано рядок. Якщо в цьому рядку буква f зустрічається тільки один раз, виведіть її індекс. Якщо
вона зустрічається два і більше разів, виведіть індекс її першого і останнього входження. Якщо
буква f в цьому рядку не зустрічається, нічого не виводьте.
'''

a = input('Введите рядок : ')
if a.count('f') == 1:
    print("Индекс f =", a.find('f'))
elif a.count('f') >= 2:
    print("Первый индекс f =", a.find('f'), "\nПоследний индекс f =", a.rfind('f'))
