'''
17. Дано список A, кількість елементів якого N. Сформувати новий список B того ж розміру за таким
правилом: елемент BK дорівнює середньому арифметичному елементів масиву A з номерами від 1 до к.
'''


n = int(input('Введите кол-во элементов : '))
a = [i for i in range(n)]
print('Список А =',a)


bk = int(sum(a)/len(a))
print ('Среднее арифметическое массива A =', bk)


b = [i for i in range(bk)]
print('Список В =',b)