"""
1. Завдання:
Розробіть функції для здійснення наступних операцій зі списками:
1. Введення списку;
2. Заповнення списку випадковими числами;
3. Виведення списку;
4. Пошук елементу за значенням;
5. Пошук максимального елементу;
6. Сортування списку за зростанням (спаданням);
7. Пошук середнього арифметичного;
Помістіть функції в окремий модуль. Реалізуйте програму, яка використовує всі функції зі створеного
модуля. Зробіть описи Doc strings для кожної реалізованої функції.
"""

import function

print('3.Виведення списку')
print('Список із введеними числами:')
function.output_list_1()
print('Список із випадковими числами: ')
function.output_list_2()
print('')

print('4.Пошук елемента за значенням')
print('Зі списку із введеними числами:')
print(function.search_item_1())
print('Зі списку із випадковими числами:')
print(function.search_item_2())
print('')

print('5.Пошук максимального елемента')
print('Зі списку із введеними числами:')
print(function.search_max_1())
print('Зі списку із випадковими числами:')
print(function.search_max_2())
print('')

print('6.Сортування списку по зростанню (спаданню)')
print('Зі списку із введеними числами:')
print(function.sorting_list_1())
print('Зі списку із випадковими числами:')
print(function.sorting_list_2())
print('')

print('7.Пошук середнього арифметичного')
print('Зі списку із введеними числами:')
print(function.search_average_1())
print('Зі списку із випадковими числами:')
print(function.search_average_2())
