'''
19. Знайти корені квадратного рівняння A · x^2 + B · x + C = 0, заданого своїми коефіцієнтами A, B, C
(A>0), якщо відомо, що дискримінант рівняння позитивний.
Вивести спочатку менший, а потім більший із знайдених коренів. 
Коріння квадратного рівняння знаходяться за формулою x1, 2 =(−B ± (D)^(1/2))/(2·A), де D - дискримінант, що дорівнює B^2 − 4·A·C.
'''

import math

print("ax^2 + bx + c = 0")
A = float(input("Введите коэфициент a - "))
B = float(input("Введите коэфициент b - "))
C = float(input("Введите коэфициент c - "))

D=B**2-4*A*C
print("Дискриминант D =",D)

if D>0:
    x1=(-B + math.sqrt(D)) / (2 * A)
    x2=(-B - math.sqrt(D)) / (2 * A)
    if x1>x2:
        print("Меньший корень =",x2)
        print("Больший корень =",x1)
        if x1<x2:
            print("Меньший корень =",x1)
            print("Больший корень =",x2)
elif D == 0:
  x = -b / (2 * a)
  print ("Корень =", x)
else:
 print("Корней нет")