'''
7. Одиниці маси пронумеровані в такий спосіб: 1 - кілограм, 2 - міліграм, 3 - грам, 4 - тонна, 5 -
центнер. Дано номер одиниці маси (ціле число в діапазоні 1-5) і маса тіла в цих одиницях (дійсне
число). Знайти масу тіла в кілограмах
'''

n=int(input("Введите число n от 1 до 5: "))

if 1<=n<=5:
    a=int(input("Введите массу тела : "))
    if n==1:
        print("Масса в килограммах =",a)
        print("Масса в килограммах =",a)
    if n==2:
        print("Масса в миллиграммах =",a)
        print("Масса в килограммах =",a/1000000)
    if n==3:
        print("Масса в граммах =",a)
        print("Масса в килограммах =",a/1000)
    if n==4:
        print("Масса в тоннах",a)
        print("Масса в килограммах =",a/0.001)
    if n==5:
        print("Масса в центнерах =",a)
        print("Масса в килограммах =",a/0.01)
else:
    print("Число введено неправильно")