'''
17. Дано три цілих числа. Визначте, скільки серед них збігаються. Програма повинна вивести одне з
чисел: 3 (якщо все збігаються), 2 (якщо два збігається) або 0 (якщо все числа різні).
'''

print("Введите три числа")
print("")
x1=int(input("Первое : "))
x2=int(input("Второе : "))
x3=int(input("Третье : "))
print("")

if x1==x2==x3:
    print("3")
elif x1==x2!=x3 or x1==x3!=x2 or x3==x2!=x1:
    print("2")
else:
    print("0")

