
'''
12. Дано чотири цілих числа, одне з яких відмінно від трьох інших, рівних між собою. 
Вивести порядковий номер цього числа.
'''

print("Введите четыре числа, три из которых равны")
print("")
x1=int(input("Первое : "))
x2=int(input("Второе : "))
x3=int(input("Третье : "))
x4=int(input("Четвертое : "))
print("")
if x1==x2==x3!=x4:
    print("Четвертое число отличается")
if x1==x2==x4!=x3:
    print("Третье число отличается")
if x1==x4==x3!=x2:
    print("Второе число отличается")
if x4==x2==x3!=x1:
    print("Первое число отличается")
else:
    print("Числа введены неверно")