'''
5. Описати рекурсивну функцію Combin1 (N, K) цілого типу, яка знаходить C (N, K)
- число поєднань з N елементів по K - за допомогою рекурентного
співвідношення:
C (N, 0) = C (N, N) = 1,
C (N, K) = C (N - 1, K) + C (N - 1, K - 1) при 0 <K <N.
Параметри функції - цілі числа; N> 0, 0 ≤ K ≤ N. Дано число N і п'ять різних
значень K. Вивести числа C (N, K) разом з кількістю рекурсивних викликів функції
Combin1, що необхідні для їх знаходження.
'''

import random

def Combin1(N,K):
    if K == 0:
        return 1
    if N == K:
        return 1
    y = Combin1(N-1,K) + Combin1(N-1,K-1)
    return y

N = int(input('Введите N > 0 - '))

for i in range(5):
  K = random.randrange(0,N)
  print("k =",K)
  y = Combin1(N,K)
  print("Число сочетаний из N элементов по K:", y)

