'''
17. Дано ціле число N (> 1). Знайти найменше ціле число K, при якому виконується нерівність 3K> N
'''

N = int(input('Введите число N = '))
K = 1
 
while not 3*K > N:
    K += 1
    print(K)