"""
7. Описати функцію Calc (A, B, Op) дійсного типу, що виконує над ненульовими
дійсними числами A та B одну з арифметичних операцій і повертає її
результат. Вид операції визначається цілим параметром Op: 1 - віднімання, 2 -
множення, 3 - ділення, інші значення - додавання. За допомогою Calc виконати
для даних A і B операції, які визначаються даними цілими N1, N2, N3.
"""

A = int(input('Введите число A = '))
B = int(input('Введите число B = '))
print('Выберите операцию: \n1 - вычитание \n2 - умножение \n3 - деление \nДругое значение - суммирование')
Op = int(input('Введите значение операции : '))


def Cacl(A, B, Op):
    if Op == 1:
        N1 = A - B
        print(N1)
    elif Op == 2:
        N2 = A * B
        print(N2)
    elif Op == 3:
        N3 = A / B
        print(N3)
    else:
        print(A + B)

Cacl(A, B, Op)