"""
7. Описати функцію Fact (N) дійсного типу, яка обчислює значення факторіала N!
= 1 · 2 · ... · N (N> 0 - параметр цілого типу; функція повертає дійсне значення
для того, щоб уникнути цілочисельного переповнення при великих значенняхN).
За допомогою цієї функції знайти факторіали п'яти даних цілих чисел.
"""

def Fact(n):
    fact = 1
    for num in range(2, n + 1):
        fact *= num
    return fact

for i in range(5):
    n = int(input('Введіть число : '))
    print("Факторіал числа = ",Fact(n))
